; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image2 - mode
	image3 - mode
	image0 - mode
	spectrograph4 - mode
	thermograph1 - mode
	Star4 - direction
	GroundStation0 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star4)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 image2)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 image0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 image2)
	(supports instrument7 thermograph1)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation3)
	(supports instrument8 image3)
	(calibration_target instrument8 GroundStation2)
	(calibration_target instrument8 GroundStation5)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon11)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(have_image Phenomenon6 spectrograph4)
	(have_image Planet7 image0)
	(have_image Phenomenon8 image3)
	(have_image Planet9 image0)
	(have_image Phenomenon10 spectrograph4)
	(have_image Phenomenon11 spectrograph4)
	(have_image Planet12 spectrograph4)
	(have_image Phenomenon13 spectrograph4)
))

)

; plan
1. (turn_to satellite2 groundstation2 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 groundstation2)
   goals met: 0 of 9
2. (switch_on instrument8 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument8)
   goals met: 0 of 9
3. (calibrate satellite2 instrument8 groundstation2)
   added: (calibrated instrument8)
   goals met: 0 of 9
4. (turn_to satellite2 phenomenon8 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon8)
   goals met: 0 of 9
5. (turn_to satellite1 groundstation2 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 9
6. (turn_to satellite0 star4 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star4)
   goals met: 0 of 9
7. (take_image satellite2 phenomenon8 instrument8 image3)
   added: (have_image phenomenon8 image3)
   goals met: 1 of 9
8. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 1 of 9
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 9
10. (calibrate satellite1 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 1 of 9
11. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 1 of 9
12. (turn_to satellite0 phenomenon10 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon10)
   goals met: 1 of 9
13. (take_image satellite0 phenomenon10 instrument0 spectrograph4)
   added: (have_image phenomenon10 spectrograph4)
   goals met: 2 of 9
14. (turn_to satellite0 phenomenon11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 9
15. (take_image satellite0 phenomenon11 instrument0 spectrograph4)
   added: (have_image phenomenon11 spectrograph4)
   goals met: 3 of 9
16. (turn_to satellite0 phenomenon13 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 9
17. (take_image satellite0 phenomenon13 instrument0 spectrograph4)
   added: (have_image phenomenon13 spectrograph4)
   goals met: 4 of 9
18. (turn_to satellite0 phenomenon6 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 9
19. (take_image satellite0 phenomenon6 instrument0 spectrograph4)
   added: (have_image phenomenon6 spectrograph4)
   goals met: 5 of 9
20. (turn_to satellite0 planet12 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet12)
   goals met: 5 of 9
21. (take_image satellite0 planet12 instrument0 spectrograph4)
   added: (have_image planet12 spectrograph4)
   goals met: 6 of 9
22. (turn_to satellite0 groundstation0 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 groundstation0)
   goals met: 7 of 9
23. (turn_to satellite1 planet7 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet7)
   goals met: 7 of 9
24. (take_image satellite1 planet7 instrument5 image0)
   added: (have_image planet7 image0)
   goals met: 8 of 9
25. (turn_to satellite1 planet9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet9)
   goals met: 8 of 9
26. (take_image satellite1 planet9 instrument5 image0)
   added: (have_image planet9 image0)
   goals met: 9 of 9
